#include "Collider.h"
//#include "Wireframe.h"

/// -------------------------------------------------------------
///						　	初期化処理
/// -------------------------------------------------------------
void Collider::Initialize() {}

/// -------------------------------------------------------------
///						　	 更新処理
/// -------------------------------------------------------------
void Collider::Update() {}

/// -------------------------------------------------------------
///						　	 描画処理
/// -------------------------------------------------------------
void Collider::Draw() {
	Vector3 center = GetCenterPosition();
	//Wireframe::GetInstance()->DrawSphere(center, radius_, defaultColor); // 白色の球で表示
}
