#include"MyGame.h"

int WINAPI WinMain(HINSTANCE, HINSTANCE, LPSTR, int) {



	/*-----------------------------------------------------------------------------------------------------------
	|																											|
	|												初期化														|
	|																											|
	-----------------------------------------------------------------------------------------------------------*/
	
	MyGame myGame;
	myGame.Initialize();
	
	//ウィンドウの×ボタンんが押されるまでループ
	while (true) {
		

		//ウィンドウにメッセージが来てたら最優先で処理させる


		/*-----------------------------------------------------------------------------------------------------------
		|																											|
		|												更新処理														|
		|																											|
		-----------------------------------------------------------------------------------------------------------*/
		
		myGame.Update();

		//終了リクエストがあったらループを抜ける
		if (myGame.IsEndRequest()) {
			break;
		}

		/*-----------------------------------------------------------------------------------------------------------
		|																											|
		|												描画処理														|
		|																											|
		-----------------------------------------------------------------------------------------------------------*/
#pragma region 描画処理
		
		myGame.Draw();
#pragma endregion 描画処理
	}

#pragma region AllRelease
	myGame.Finalize();
#pragma endregion AllRelease


	return 0;

}